Chapters/Introduction.tex
\chapter{Introduction}
\label{ch:int}
This is a work of moral philosophy.
I am setting out to provide moral foundations for a better world -- a world that
is more caring and less cruel. 
I want to set out and defend basic moral tenets that vindicates the value of all
living beings and the worlds that they live in.
Central to this set of tenets is the view that nothing is to be treated as
expendable---nothing to be regarded ``merely a thing.''
\section{Some claims about metathics}
\label{sec:orge34c5bf}

\begin{enumerate}
\item Ethical claims are normative claims.
\end{enumerate}
\section{Desires and evaluative judgments}
\label{sec:org7b4b7ea}
\begin{description}
\item[{Desire}] u
\end{description}
\section{A few judgments.}
\label{sec:judgments}
My moral position depends on a few moral, evaluative and practical judgments.
The first two judgments are:
\begin{enumerate}
\item My happiness is good in itself.
\item My happiness is worth my care and my effort.
\end{enumerate}
The first of these judgments is primarily an evaluative judgment.
It says that when I consider my own happiness, I view it as a good thing---not
simply as something that I want.
I approve of it.
The second is a practical judgment: a judgment about what I am to do, or ought to
do, or what is worth doing.

Let's take a closer look at what this mea

To see what this means more clearly it will be helpful to take a step back.


It tells me that the effort and care that I spend working on my

\begin{enumerate}
\setcounter{enumi}{2}
\item The happiness of others is good in itself.
\item The happiness of others is worth my care and my effort.
\end{enumerate}
\section{What is a thing?}
\label{sec:whatisthing}
